InformationRegisters/ЗагрузкаКандидатовИзИнтернета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЗагрузкаКандидатовИзИнтернета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресРезюме</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вакансия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьГруппаДоступаФизическогоЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступностьКомментария</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоступностьКомментарияКандидата</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗагрузкиКандидатовИзИнтернета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийСостояния</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаДоступаКандидата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКандидатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Кандидат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кандидаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолКандидата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииОКандидатах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отложена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияЗагрузкиКандидатовИзИнтернета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияЗагрузкиКандидатовИзИнтернета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЗагрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактыЗакрыты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕстьОднофамильцы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ЗагрузкаКандидатовИзИнтернета/Forms/НеЗагруженныйКандидат/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.Проверить(Параметры.Свойство("Идентификатор"), 
		СтрШаблон(НСтр("ru = 'В параметрах открытия не заполнено поле %1'"), "Идентификатор"));

	ПрочитатьЗапись(Параметры.Идентификатор);
	УстановитьСвойстваЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ОбработатьОповещениеФормыКандидата(ИмяСобытия, Параметр);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АдресРезюмеНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(Запись.АдресРезюме);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	НачатьЗагрузкуКандидата();
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)
	ОтложитьЗагрузку(Запись.Идентификатор);
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Запись.ИсходныйКлючЗаписи);
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьЗапись(Идентификатор)
	
	МенеджерЗаписи = РегистрыСведений.ЗагрузкаКандидатовИзИнтернета.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Идентификатор = Идентификатор;
	МенеджерЗаписи.Прочитать();
	
	ЗначениеВРеквизитФормы(МенеджерЗаписи, "Запись");
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗагрузкуКандидата()
	
	ДляЗаписи = Новый Структура();
	ДляЗаписи.Вставить("ИдентификаторЗагрузки", Запись.Идентификатор);
	ДляЗаписи.Вставить("ЗагруженВручную", Истина);
	
	РекрутинговыеСайтыКлиент.НачатьСозданиеКандидатаПоАдресуРезюме(
		ЭтотОбъект, Запись.АдресРезюме, Запись.Вакансия, ДляЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваЭлементовФормы()
	
	Элементы.КомментарийСостояния.Видимость = ЗначениеЗаполнено(Запись.КомментарийСостояния);
	Элементы.КомментарийПользователя.Видимость = ЗначениеЗаполнено(Запись.КомментарийПользователя);
	
	КлючСохраненияПоложенияОкна = СтрШаблон(
		"Состояние=%1,КомментарийСостояния.Видимость=%2,КомментарийПользователя.Видимость=%3", 
		Запись.Состояние,
		Элементы.КомментарийСостояния.Видимость,
		Элементы.КомментарийПользователя.Видимость);
	
	Элементы.СостояниеКартинка.Картинка = КартинкаПоСостоянию(Запись.Состояние);
	Элементы.Состояние.РасширеннаяПодсказка.Заголовок = ПодсказкаПоСостоянию(Запись.Состояние);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтложитьЗагрузку(Идентификатор)
	РегистрыСведений.ЗагрузкаКандидатовИзИнтернета.ОтложитьЗагрузкуКандидата(Идентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОповещениеФормыКандидата(ИмяСобытия, Параметр)

	Если ИмяСобытия <> "Запись_Кандидаты" Тогда
		Возврат;
	КонецЕсли;

	ИдентификаторЗагрузки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметр, "ДляЗаписи"),
		"ИдентификаторЗагрузки");

	Если ИдентификаторЗагрузки = Запись.Идентификатор Тогда
		ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Запись.ИсходныйКлючЗаписи);
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция КартинкаПоСостоянию(Состояние)
	Возврат Перечисления.СостоянияЗагрузкиКандидатовИзИнтернета.КартинкаПоСостоянию(Состояние);
КонецФункции

&НаСервереБезКонтекста
Функция ПодсказкаПоСостоянию(Состояние)

	Подсказка = "";
	Если Состояние = Перечисления.СостоянияЗагрузкиКандидатовИзИнтернета.ЕстьОднофамильцы Тогда
		Подсказка = НСтр("ru = 'При загрузке кандидата выяснилось, что в информационной базе уже есть один или несколько человек с такими именем. 
						 |К сожалению, автоматически разрешить такой конфликт невозможно.
						 |Пожалуйста, загрузите кандидата вручную, после чего выберите этого человека, если он уже есть в списке, или добавьте кандидата как однофамильца.'");
	ИначеЕсли Состояние = Перечисления.СостоянияЗагрузкиКандидатовИзИнтернета.КонтактыЗакрыты Тогда
		Подсказка = НСтр("ru = 'В резюме этого кандидата скрыт доступ к ФИО и контактам. 
						 |К сожалению, пока добавить в систему кандидата с не заполненным ФИО невозможно.
						 |Пожалуйста, загрузите кандидата вручную, после чего заполните ему фамилию и имя через форму.'");
	ИначеЕсли Состояние = Перечисления.СостоянияЗагрузкиКандидатовИзИнтернета.ОшибкаЗагрузки Тогда
		Подсказка = НСтр("ru = 'К сожалению, при загрузке этого резюме произошла ошибка.
						 |Вы можете попробовать загрузить кандидата вручную, но если ошибка будет повторяться, обратитесь, пожалуйста, к администратору.'");
	Иначе
		// Подсказка для остальных состояний не требуется.
	КонецЕсли;
	
	Возврат Подсказка;
	
КонецФункции

#КонецОбласти
